Autodesk.Revit.UI.ProjectBrowserItemInfo.IsEdited(Autodesk.Revit.DB.Document)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserItemInfo.CanExpandByDoubleClick
Since:
2024

Autodesk.Revit.UI.ProjectBrowserItemInfo.GetTypeForImage(Autodesk.Revit.DB.Document)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserItemInfo.GetStateImgIndex(Autodesk.Revit.DB.Document)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserItemInfo.GetItemType
Since:
2024

Autodesk.Revit.UI.ProjectBrowserItemInfo.GetParentIndex
Since:
2024

Autodesk.Revit.UI.ProjectBrowserItemInfo.GetIndex
Since:
2024

Autodesk.Revit.UI.ProjectBrowserItemInfo.GetName
Since:
2024

Autodesk.Revit.UI.ProjectBrowserItemInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ProjectBrowserItemInfo
A class visit data of ProjectBrowser Item.
Since:
2024